{
  "date": "2020-12-23T16:57:41.487Z",
  "title": "お知らせリスト",
  "slug": "moripanews1",
  "description": "アップデート、サーバー設定の変更点などをお知らせします",
  "category": "info",
  "body": "- - -\n\n## 【ショップ削除に関するバグ報告】('21/11/27)\n\n* 近いうちにQuickShopやチェスト類に関する制限を設ける可能性があるため、一旦、樽でのショップ作成を無効化しました。無効化している間は、チェストでのショップ作成をお願いいたします。\r\n\r\nまた、クライアント負荷軽減のため、１チャンク内に作成するショップ数や、設置するチェスト数や看板数をなるべく減らすようお願いいたします。\r\n\r\n突然の変更でご迷惑をおかけしますが、何卒ご理解とご協力をお願いいたします。\n\n- - -\n\n## 【ショップ削除に関するバグ報告】('21/11/27)\n\n* ショップの定期削除機能の不具合で90日以上経過していないショップも幾つか削除されてしまいました。バックアップから復元しようにも、看板自体が消滅してしまっているため、復元しても破損したショップとして扱われて消えてしまうので復元不可となっています。誠に申し訳ありませんが、各自でショップの再作成をお願いいたします。\n\n- - -\n\n## 【サーバー設定の変更】('21/11/27)\n\n* 三か月以上経過したブロック破壊ログは自動的に削除されるようになりました。\n\n- - -\n\n## 【QuickShopアップデート！】('21/11/27)\n\nショップを作る機能をバージョン4から5へアップデートしました！\n\n今回のアップデートで沢山の変更及び追加がありましたが、プレイヤーの皆様に影響のある内容はこちらです！\n\nショップをクリックした際や、ショップ関連のコマンドを実行した場合、皆さんのPC側の言語でメッセージが表示されるようになりました。グローバル化！\n\nショップの所有者が長期間ログインしていなかった場合や、BANされた場合にショップが自動的に削除されるようになりました！(不在期間は決まり次第連絡します)\n\n一部のメッセージの翻訳がされていない問題は時間がある時に翻訳作業のボランティアを行いますので少しの間辛抱してください！\n\nそれでは新しいショップ機能をお楽しみください～\n\n* アップデートに伴い、ショップの維持費が正常に徴収されていなかった問題が修正されています。\n* 上記問題解決に伴い、１ショップごとに「ショップなどの売上から〇〇円受け取りました」というメッセージが頻繁に表示されるようになってしまった為、こちらのメッセージを無効化しました。\n  ショップの在庫が減っている際に表示されるメッセージは今まで通り表示されますが、不便であればお知らせください。\n* 3カ月以上ログインしていないプレイヤーのショップが自動的に削除されるようになりました。チェスト内のアイテムは消えませんのでご安心ください。\n* ショップの検索機能(/qs find)の不具合を解消しました。不具合解消とともに、検索結果一覧を見やすく改善しました。\r\n\r\n* Out of Stock を 在庫切れ と翻訳しました。\n- - -\n\n## 【サーバー設定の変更】('21/11/26)\n\n* mobgriefingの有効化\n\n  >   村人負荷増加の影響で一時的に村人が繁殖しないように無効化しておりましたが、村人の設定を見直したので再度有効化しました。この設定はキツネなどの他のMOBの行動も元通りになります。\n* スポナーの停止\n\n  > 生活サーバーの負荷軽減のためにスポナーを停止しております。\n\n上記の設定を変更していたにも関わらず報告を失念しておりました。プレイヤーの皆様に御迷惑をおかけした事をお詫び申し上げます。\n\nサーバーは負荷に応じて頻繁に設定を変更しております。プレイに殆ど影響のない場合は報告をしない場合がありますが、プレイに大きな影響がある場合は報告を怠らないように以後気をつけます。\n\n- - -\n\n## 【村人のバグ修正】('21/01/17)\n\n村人ゾンビを用いた取引のバグ技を修正しました\n\n- - -\n\n## 【ヤマゾン廃止】('21/01/17)\n\n作者のやる気がない影響で重大な不具合修正などが行われないのでヤマゾンシステムを廃止しました。\\\n出品されていたアイテムはすべて運営側で買取しました。\\\n出品していた商品の返品やその他お困りごとがありましたらお気軽にご相談下さい！！\n\n- - -\n\n## 【1.16.5アップデート！（全サーバー）】('21/01/17)\n\nサーバーをMinecraft 1.16.5へアップデートしました。\n1.16.4でも入れますのでプレイヤーの方々はいつもどおりログインして大丈夫です！！\n\n- - -\n\n## 【自動補充機能の有効化！（生活サーバー）】('21/01/13)\n\nチェストクリーナーの自動補充機能を有効化したよ！\nこれからは手に持っているアイテムが無くなった時に、インベントリ内に同じアイテムがあれば、そのアイテムが手に自動補充されるようになったよ！\n\n資源サーバーでは既にこの機能が有効化されてたんだけど、理由は謎！！\n\n- - -\n\n## 【魚釣りプラグインを更新しました！（生活サーバー）】('21/01/10)\n\nこんばんわにのこ！\nうにたろす！\n\n魚釣りプラグインを更新したよ！\n・釣った魚の説明文が変更されました！\n・一部の魚に追加の説明文が表示されます！\n・表彰台が正しく更新されるようになりました！\n\n- - -\n\n## 【資源サーバーのリセット完了】('21/01/13)\n\n資源サーバーのリセット完了しましたこんにちわにのこ！\n寒い！寝坊！うにたろう！！\n\n資源サーバーをリセットしました。\n新しい地で冒険を楽しみましょう。\n\n- - -\n\n## 【ストレージ制限の緩和】('21/01/17)\n\nこんばんわにのこ！\n\nチェストなどのインベントリを持つブロックの、1チャンク内に置ける制限(128個迄)を撤廃しました。\\\nこれまで通り、1チャンク内に置けるブロックエンティティの数は256個に制限されていますのでご注意下さい。\n\n![](/img/bulkshop.png \"看板を右クリックすると値段や個数を変更できるよ\")\n\n- - -\n\n## 【ショップにまとめ売り機能を追加】('20/12/25)\n\nメリークリスマス！\n副管理人のうにたろうです 。\\\n僕からの細やかなクリスマスプレゼントを受け取って下さい  。\n\nショップで複数個のまとめ売りが出来るようになりました 。\n今後は手に持っているアイテムの個数が販売個数にそのまま反映されるので注意してくださいね！\nもし間違ったとしても、看板を右クリックすれば1商品あたりの個数を変更出来るのでご安心下さい 。\n\nさらに、ショップの検索範囲が半径45ブロックから10000000ブロックに変わりました。\nショップの検索アルゴリズムが最適化され、半径10000000ブロックを検索しても重くならなくなったので、検索範囲を変更しました！これからは/qs find \\[検索したいアイテムの名前] でどんなに遠いところにあるアイテムでも一瞬で検索できちゃいます\n\n- - -\n\n## 【バグ利用者の処罰及び小切手機能の停止】('20/12/23)\n\nこんばんわにのこ 副管理人のうにたろうです このような事をお知らせする事が本当に残念でなりませんし、はらわたが煮えくり返っています。\n\n> バグを利用した所持金の増殖を行ったプレイヤー、及びそれを広めたプレイヤーの所持金をリセットします。 小切手の機能を停止いたします。\n\n現在、QuickShop(チェストを用いたショップ機能)とお金の連携機能にバグが存在しています。プレイヤーのオフライン時にショップで購入(売却)すると売上金が２倍になる事があります。このバグは以前より発生しており、原因となっているプラグインであるMySQL Player Data Bridge(お金やインベントリのサーバー間共有機能)の開発者には既にバグ報告を行っています。しかし、一向に改善されないのが現状です。私達ではどうにも出来ません。 \n\nどういう意図を持っているのか分かりませんが、このバグを広めたプレイヤーがいます。そして、そのバグを利用して所持金を増殖させているプレイヤーもいます。当サーバーではバグ技の利用はルール違反ですので、もちろん処罰いたします。「直さない運営が悪い」と仰っているプレイヤーもいるようですが、前述した通り*直さないのではなく直せない*のです。運営が悪いと言われる筋合いはありませんし、直す努力も怠ってはいません。~~ぶん殴られてえのか~~ \n\nそしてバグ技を悪用しているプレイヤーは小切手を利用しています。小切手はプレイヤーが個人で主催するイベントなどで楽しむ為に開放された機能でした。しかし、開放してみるとデスペナルティの回避やバグ技に利用されてしまう始末。本来意図していた機能を果たしておりませんでしたので、小切手の機能を停止いたしました。\n\n小切手を保有しており、バグ技に利用していないという方がいらっしゃいましたら、**補填いたします**ので問い合わせフォームにてご連絡をお願いいたします。 繰り返しますが、このようなバグ技を利用したり、広めたりするプレイヤーがいる事が残念でなりません。このような下らない事に時間を割かせる行為は、ボランティアで活動している運営陣をぞんざいに扱う事と同義であり、到底許されるべきではありません。過去には長期間活動しているプレイヤーをバグ技の利用でBANした事もあります。長期間活動していて処罰が軽くなるような事はありません。処罰されるプレイヤーの方々は自らの言動を省みるようお願いいたします。 今後もバグ技を利用していると判断された場合には処罰が下されますのでご注意下さい。 \n\n\\[追記] 勘違いしている方が一部いらっしゃいますので追記しますが、今回は意図的にバグを利用した事が問題であり、**ログアウト時知らずにバグで所持金が増殖している事は問題ではありません**。ですので、所持金がバグで増えていたとしても返金する必要はありませんのでご安心下さい。\n\n- - -\n\n## 【消費税の廃止】('20/12/23)\n\n消費税システムを上手く活用できていないため廃止したしました。\n\n- - -\n\n## 【checkコマンドを追加】('20/12/23)\n\n全てのプレイヤーは/checkコマンドを使えるようになりました。\n/checkコマンドは立っている場所のブロックエンティティの設置数を確認できるコマンドです。\n\n- - -\n\n- - -\n\n### リンク\n\n* [もりのパーティ公式HP-最新情報](https://morino.party/news/add-news/)：主な更新情報、イベント情報を掲載しています。\n* [もりのパーティ公式Wiki](https://wiki.morino.party)：みんなで作るまとめサイト - 誰でも編集できるよ\n* [お問い合わせフォーム](https://forms.gle/GpYYVKpYkXgjQCmU7)：ご意見・相談・通報などはこちらから"
}