{
  "date": "2020-12-23T16:57:41.487Z",
  "title": "お知らせリスト",
  "slug": "moripanews1",
  "description": "アップデート、サーバー設定の変更点などをお知らせします",
  "category": "info",
  "body": "\\[[toc]]!\n\n- - -\n\n## 【ストレージ制限の緩和】('20/12/25)\n\nこんばんわにのこ！\nh(ry\n\nチェストなどのインベントリを持つブロックの、1チャンク内に置ける制限(128個迄)を撤廃\\\nこれまで通り、1チャンク内に置けるブロックエンティティの数は256個に制限されていますのでご注意下さい。\n\n![](/img/bulkshop.png \"看板を右クリックすると値段や個数を変更できるよ\")\n\n- - -\n\n## 【ショップ機能のアップデート情報！】('20/12/25)\n\nメリークリスマス！\n副管理人のうにたろうです 。\\\n僕からの細やかなクリスマスプレゼントを受け取って下さい  。\n\nショップで複数個のまとめ売りが出来るようになりました 。\n今後は手に持っているアイテムの個数が販売個数にそのまま反映されるので注意してくださいね！\nもし間違ったとしても、看板を右クリックすれば1商品あたりの個数を変更出来るのでご安心下さい 。\n\nさらに、ショップの検索範囲が半径45ブロックから10000000ブロックに変わりました。\nショップの検索アルゴリズムが最適化され、半径10000000ブロックを検索しても重くならなくなったので、検索範囲を変更しました！これからは/qs find \\[検索したいアイテムの名前] でどんなに遠いところにあるアイテムでも一瞬で検索できちゃいます\n\n- - -\n\n## 【バグ利用者の処罰及び小切手機能の停止】('20/12/23)\n\nこんばんわにのこ 副管理人のうにたろうです このような事をお知らせする事が本当に残念でなりませんし、はらわたが煮えくり返っています。\n\n> バグを利用した所持金の増殖を行ったプレイヤー、及びそれを広めたプレイヤーの所持金をリセットします。 小切手の機能を停止いたします。\n\n現在、QuickShop(チェストを用いたショップ機能)とお金の連携機能にバグが存在しています。プレイヤーのオフライン時にショップで購入(売却)すると売上金が２倍になる事があります。このバグは以前より発生しており、原因となっているプラグインであるMySQL Player Data Bridge(お金やインベントリのサーバー間共有機能)の開発者には既にバグ報告を行っています。しかし、一向に改善されないのが現状です。私達ではどうにも出来ません。 \n\nどういう意図を持っているのか分かりませんが、このバグを広めたプレイヤーがいます。そして、そのバグを利用して所持金を増殖させているプレイヤーもいます。当サーバーではバグ技の利用はルール違反ですので、もちろん処罰いたします。「直さない運営が悪い」と仰っているプレイヤーもいるようですが、前述した通り*直さないのではなく直せない*のです。運営が悪いと言われる筋合いはありませんし、直す努力も怠ってはいません。~~ぶん殴られてえのか~~ \n\nそしてバグ技を悪用しているプレイヤーは小切手を利用しています。小切手はプレイヤーが個人で主催するイベントなどで楽しむ為に開放された機能でした。しかし、開放してみるとデスペナルティの回避やバグ技に利用されてしまう始末。本来意図していた機能を果たしておりませんでしたので、小切手の機能を停止いたしました。\n\n小切手を保有しており、バグ技に利用していないという方がいらっしゃいましたら、**補填いたします**ので問い合わせフォームにてご連絡をお願いいたします。 繰り返しますが、このようなバグ技を利用したり、広めたりするプレイヤーがいる事が残念でなりません。このような下らない事に時間を割かせる行為は、ボランティアで活動している運営陣をぞんざいに扱う事と同義であり、到底許されるべきではありません。過去には長期間活動しているプレイヤーをバグ技の利用でBANした事もあります。長期間活動していて処罰が軽くなるような事はありません。処罰されるプレイヤーの方々は自らの言動を省みるようお願いいたします。 今後もバグ技を利用していると判断された場合には処罰が下されますのでご注意下さい。 \n\n\\[追記] 勘違いしている方が一部いらっしゃいますので追記しますが、今回は意図的にバグを利用した事が問題であり、**ログアウト時知らずにバグで所持金が増殖している事は問題ではありません**。ですので、所持金がバグで増えていたとしても返金する必要はありませんのでご安心下さい。"
}